In [1]:
import pandas as pd

In [2]:
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [8]:
data = pd.read_csv('hiring.csv')
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [9]:
data.experience = data.experience.fillna('zero')
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [10]:
score_mean = data['test_score(out of 10)'].mean()

In [11]:
score_mean

7.857142857142857

In [12]:
import math
score_mean = math.floor(score_mean)
score_mean

7

In [14]:
data['test_score(out of 10)']=data['test_score(out of 10)'].fillna(score_mean)
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [16]:
# pip install word2number

Collecting word2numberNote: you may need to restart the kernel to use updated packages.
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number

  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5583 sha256=ae35ec1151bbec6fd72e53bc1e98269056fec3abb4fe211e8a5bf9855fcbb5c2
  Stored in directory: c:\users\palla\appdata\local\pip\cache\wheels\a0\4a\5b\d2f2df5c344ddbecb8bea759872c207ea91d93f57fb54e816e
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

In [17]:
from word2number import w2n

In [19]:
data.experience=data.experience.apply(w2n.word_to_num) # data framile or coluthilek braketinullil parayinna fun kodkkan

In [20]:
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [21]:
x=data.drop('salary($)',axis=1)
y=data['salary($)']

In [22]:
x

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    7.0                           7
7          11                    7.0                           8

In [23]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [24]:
model=LinearRegression()
model.fit(x,y)

LinearRegression()

In [25]:
model.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [26]:
model.intercept_

14992.65144669314

In [27]:
y_pred= model.predict(x)

In [28]:
y_pred

array([52090.46734071, 45648.01964161, 57964.2290839 , 64525.1061363 ,
       68325.21184635, 60783.44785255, 74796.8832586 , 79866.63483999])

In [29]:
pd.DataFrame({'True y values:':y , 'Predicted y values':y_pred})

   True y values:  Predicted y values
0           50000        52090.467341
1           45000        45648.019642
2           60000        57964.229084
3           65000        64525.106136
4           70000        68325.211846
5           62000        60783.447853
6           72000        74796.883259
7           80000        79866.634840

In [31]:
model.score(x,y)

0.977013901427314

In [ ]:
# when target values are continues such problems are called regression problems